#ifndef __cycleencriptionh__
#define __cycleencriptionh__

//------------------------------------------------------------------------------
// oop.h - содержит описание функционального ЯП
//------------------------------------------------------------------------------

#include <fstream>
#include "constants.h"

//------------------------------------------------------------------------------
// объектно-ориентированный ЯП
struct oop {
    // сдвиг
    int shift;
    // длина строки
    int str_len;
    // текст
    char[] *encrypted_str;
};

// Ввод параметров объектно-ориентированного ЯП из файла
void In(oop &o, std::ifstream &ifst);

// Случайный ввод параметров объектно-ориентированного ЯП
void InRnd(oop &o);

// Вывод параметров объектно-ориентированного ЯП в форматируемый поток
void Out(oop &o, std::ofstream &ofst);

char[] *Decrypt();

#endif  // __cycleencriptionh__
